In [1]:
import pandas as pd
import numpy as np

from pandas import Series

# Lambda 함수
한 주로 함수를 표현하는 익명 함수 기법

Lips 언어에서 시작된 기법으로 오늘날 현대언어에 많이 사용

기존 함수는 아래처럼 사용했다.

In [5]:
def f(x , y):
    return x + y

f(1,4)

5

함수를 정의해주고 반환값을 지정해줬다.

람다를 이용하면 아래처럼 나타 낼 수 있다.

In [6]:
f = lambda x,y: x + y
f(1,4)

5

여러 경우에서 쓰일 수 있는데 몇가지 예를 들어보자.

하나의 argument만 처리하는 lambda 함수

In [7]:
f = lambda x: x / 2
f(3)

1.5

In [8]:
f = lambda x: x ** 2
f(3)

9

위에는 f라고 이름을 할당했지만 아예 이름도 할당시키지 않을 수 있다.

In [9]:
(lambda x: x +1)(5)

6

# map & replace

## map함수
함수와 sequence형 데이터를 인자로 받아 각 element마다 입력받은  함수를 적용하여 list로 반환

일반적으로 함수를 lambda 형태로 표현

파이썬3에서는 map을 쓸때 앞에 list를 붙어줘야 한다.

예시로 거듭제곱을 하는것을 만들어보자

In [10]:
ex = [1,2,3,4,5]
f = lambda x: x ** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

argument가 두개 이상이면 갯수 맞춰서 sequence형을 써야함

In [13]:
f = lambda x, y,z: x + y+ z
list(map(f, ex, ex,ex))

[3, 6, 9, 12, 15]

익명 함수를 그대로 사용할 수도 있다.

In [14]:
list(map(lambda x: x+5, ex))

[6, 7, 8, 9, 10]

## map for series
Pandas의 series 타입의 데이터에도 map 사용가능

function대신 dict, sequence형 자료등으로 대체 가능

In [15]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [16]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

map 함수를 사용해서 dict 타입으로 데이터 교체할수도 있다.

없는 값은 Nan으로 반환

In [17]:
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

같은 위치의 데이터를 s2로 전환 할 수도 있다.

In [18]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [20]:
s2 = Series(np.arange(10,20))
s2

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [21]:
s1.map(s2)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

## 예제: 성별 바꾸기

In [35]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

성별이 숫자로 바껴야 처리하기 편함

따라서 성별의 특정한 값만 뽑아본다. (성별에 무슨 값들이 있는지 확인)

In [36]:
df.sex.unique()

array(['male', 'female'], dtype=object)

남자는 0 여자는 1로 바꾼다.

In [37]:
df["sex_code"] =  df.sex.map({"male":0, "female":1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

df에 성별을 숫자로 나타낸 series를 추가했다.

또 성별을 숫자로 바꿀때 replace를 사용해도 된다.

In [38]:
df.sex.replace({"male":0, "female":1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [39]:
df.sex.head(5)

0      male
1    female
2    female
3    female
4    female
Name: sex, dtype: object

하지만 실제 df에 있는 데이터가 바뀌는게 아니므로 inplace=True로 설정해야 실제 데이터가 바뀐다.

In [40]:
df.sex.replace(["male", "female"], [0,1], inplace=True)
del df["sex_code"]
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

## apply & applymap

apply: map과 달리 series전체 (column)에 해당 함수를 적용한다.
       
       입력값이 series 데이터로 입력받아 handling 가능

In [44]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

df에서 몇가지 column만 빼서 df_info로 정의하자

In [43]:
df_info = df[["earn", "height","age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [46]:
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

전체 값이 들어가서 각 column마다 f를 적용한다.

내장 연산 함수를 사용할때도 똑같은 효과를 본다. (mean, std 등등)

In [50]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [53]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

sclar값 이외에 series 값의 반환도 가능

In [49]:
def f(x):
    return Series([x.min(), x.max(), x.mean()], 
                    index=["min", "max", "mean"])
df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499

## applymap for dataframe

series 단위가 아닌 element 단위로 함수를 적용함

series 단위에 apply를 적용시킬 때와 같은 효과

In [55]:
f = lambda x : -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [56]:
f = lambda x : -x
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64